microbuilder/LPC1343CodeBase/projectconfig.h
    #ifdef CFG_BRD_LPC1343_802154USBSTICK
      #define CFG_CPU_CCLK                (72000000)  // 1 tick = 13.88nS
    #endif
/*=========================================================================*/


/*=========================================================================
    SYSTICK TIMER
    -----------------------------------------------------------------------

    CFG_SYSTICK_DELAY_IN_MS   The number of milliseconds between each tick
                              of the systick timer.

    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1343_REFDESIGN
      #define CFG_SYSTICK_DELAY_IN_MS     (1)
    #endif

    #ifdef CFG_BRD_LPC1343_TFTLCDSTANDALONE
      #define CFG_SYSTICK_DELAY_IN_MS     (1)
    #endif

    #ifdef CFG_BRD_LPC1343_802154USBSTICK
      #define CFG_SYSTICK_DELAY_IN_MS     (1)
    #endif
/*=========================================================================*/


/*=========================================================================
    UART
    -----------------------------------------------------------------------

    CFG_UART_BAUDRATE         The default UART speed.  This value is used 
                              when initialising UART, and should be a 
                              standard value like 57600, 9600, etc.  
                              NOTE: This value may be overridden if
                              another value is stored in EEPROM!
    CFG_UART_BUFSIZE          The length in bytes of the UART RX FIFO. This
                              will determine the maximum number of received
                              characters to store in memory.

    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1343_REFDESIGN
      #define CFG_UART_BAUDRATE           (115200)
      #define CFG_UART_BUFSIZE            (512)
    #endif

    #ifdef CFG_BRD_LPC1343_TFTLCDSTANDALONE
      #define CFG_UART_BAUDRATE           (115200)
      #define CFG_UART_BUFSIZE            (512)
    #endif

    #ifdef CFG_BRD_LPC1343_802154USBSTICK
      #define CFG_UART_BAUDRATE           (115200)
      #define CFG_UART_BUFSIZE            (512)
    #endif
/*=========================================================================*/


/*=========================================================================
    SSP
    -----------------------------------------------------------------------

    CFG_SSP0_SCKPIN_2_11      Indicates which pin should be used for SCK0
    CFG_SSP0_SCKPIN_0_6

    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1343_REFDESIGN
      #define CFG_SSP0_SCKPIN_2_11
      // #define CFG_SSP0_SCKPIN_0_6
    #endif

    #ifdef CFG_BRD_LPC1343_TFTLCDSTANDALONE
      #define CFG_SSP0_SCKPIN_2_11
      // #define CFG_SSP0_SCKPIN_0_6
    #endif

    #ifdef CFG_BRD_LPC1343_802154USBSTICK
      // #define CFG_SSP0_SCKPIN_2_11
      #define CFG_SSP0_SCKPIN_0_6
    #endif
/*=========================================================================*/


/*=========================================================================
    ON-BOARD LED
    -----------------------------------------------------------------------

    CFG_LED_PORT              The port for the on board LED
    CFG_LED_PIN               The pin for the on board LED
    CFG_LED_ON                The pin state to turn the LED on (0 = low, 1 = high)
    CFG_LED_OFF               The pin state to turn the LED off (0 = low, 1 = high)

    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1343_REFDESIGN
      #define CFG_LED_PORT                (2)
      #define CFG_LED_PIN                 (10)
      #define CFG_LED_ON                  (0)
      #define CFG_LED_OFF                 (1)
    #endif

    #ifdef CFG_BRD_LPC1343_TFTLCDSTANDALONE
      #define CFG_LED_PORT                (2)
      #define CFG_LED_PIN                 (10)
      #define CFG_LED_ON                  (0)
      #define CFG_LED_OFF                 (1)
    #endif

    #ifdef CFG_BRD_LPC1343_802154USBSTICK
      #define CFG_LED_PORT                (3)
      #define CFG_LED_PIN                 (2)
      #define CFG_LED_ON                  (0)
      #define CFG_LED_OFF                 (1)
    #endif
/*=========================================================================*/


/*=========================================================================
    MICRO-SD CARD
    -----------------------------------------------------------------------

    CFG_SDCARD                If this field is defined SD Card and FAT32
                              file system support will be included
    CFG_SDCARD_READONLY       If this is set to 1, all commands to
                              write to the SD card will be removed
                              saving some flash space.
    CFG_SDCARD_CDPORT         The card detect port number
    CFG_SDCARD_CDPIN          The card detect pin number

    NOTE:                     All config settings for FAT32 are defined
                              in ffconf.h

    BENCHMARK:                With SPI set to 6.0MHz, FATFS can read
                              ~300KB/s (w/512 byte read buffer)
							  
    PIN LAYOUT:               The pin layout that is used by this driver
                              can be seen in the following schematic:
                              /tools/schematics/Breakout_TFTLCD_ILI9325_v1.3

    DEPENDENCIES:             SDCARD requires the use of SSP0.
    -----------------------------------------------------------------------*/
    #ifdef CFG_BRD_LPC1343_REFDESIGN
      // #define CFG_SDCARD
      #define CFG_SDCARD_READONLY         (1)   // Must be 0 or 1
      #define CFG_SDCARD_CDPORT           (3)
      #define CFG_SDCARD_CDPIN            (0)
    #endif

    #ifdef CFG_BRD_LPC1343_TFTLCDSTANDALONE
      #define CFG_SDCARD
      #define CFG_SDCARD_READONLY         (1)   // Must be 0 or 1
      #define CFG_SDCARD_CDPORT           (3)
      #define CFG_SDCARD_CDPIN            (0)
    #endif

